trlmtr/esp32p4-ov5647/sdkconfig.defaults
# ESP32-P4 Configuration
CONFIG_IDF_TARGET="esp32p4"

# Enable PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y

# Camera sensor configuration
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y

# MIPI CSI Configuration
CONFIG_ESP_VIDEO=y
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y

# WiFi Configuration (via esp-hosted)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# WiFi Station Configuration
CONFIG_ESP_WIFI_SSID="myssid"
CONFIG_ESP_WIFI_PASSWORD="mypassword"
CONFIG_ESP_MAXIMUM_RETRY=5
CONFIG_ESP_WIFI_SCAN_AUTH_MODE_THRESHOLD=3
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y
CONFIG_ESP_WPA3_SAE_PWE_BOTH=y

# Network configuration
CONFIG_LWIP_LOCAL_HOSTNAME="esp-camera"

# Enable example connection
CONFIG_EXAMPLE_CONNECT_WIFI=y

# HTTP Server Configuration
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# mDNS
CONFIG_MDNS_HOSTNAME="esp-camera"
CONFIG_MDNS_INSTANCE="ESP32-P4 Camera"

# Camera I2C Configuration
CONFIG_CAMERA_I2C_PORT=0
CONFIG_CAMERA_SCL_PIN=8
CONFIG_CAMERA_SDA_PIN=7

# ESP-Hosted configuration
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
